InformationRegisters/AddressObjects.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>AddressObjects</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PostalIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Abbr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Additionally</Name>
					<Comment>Service ID for combination of OKATO codes, etc.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ARCACode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Relevant</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Level</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RFTerritorialEntityCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DistrictCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RegionCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>CityCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UrbanDistrictCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SettlementCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StreetCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AdditionalItemCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubordinateItemCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Comment>Global unique identifier of FTS address object</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/AddressObjects/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProceduresAndFunctions

// It updates the RF territorial entities data in the address objects.
// Records are mapped based on the RFTerritorialEntityCode field.
//
Procedure UpdateRFTerritorialEntitiesContentByClassifier(InitialFillingAndDataUpdate = False) Export
	
	Classifier = RFTerritorialEntitiesClassifier();
	
	// Select the ones that are in the layout, but are not found in the register.
	Query = New Query("
		|SELECT
		|	Parameter.RFTerritorialEntityCode AS RFTerritorialEntityCode
		|INTO
		|	Classifier
		|FROM
		|	&Classifier AS Parameter
		|INDEX BY
		|	RFTerritorialEntityCode
		|;
		|
		|SELECT
		|	Classifier.RFTerritorialEntityCode AS RFTerritorialEntityCode
		|FROM
		|	Classifier AS Classifier
		|LEFT JOIN
		|	InformationRegister.AddressObjects AS AddressObjects
		|ON
		|	  AddressObjects.Level                    = 1
		|	AND AddressObjects.RFTerritorialEntityCode              = Classifier.RFTerritorialEntityCode
		|	AND AddressObjects.RegionCode                  = 0
		|	AND AddressObjects.RegionCode                  = 0
		|	AND AddressObjects.CityCode                  = 0
		|	AND AddressObjects.UrbanDistrictCode  = 0
		|	AND AddressObjects.SettlementCode       = 0
		|	AND AddressObjects.StreetCode                   = 0
		|	AND AddressObjects.AdditionalItemCode = 0
		|	AND AddressObjects.SubordinateItemCode    = 0
		|WHERE
		|	AddressObjects.ID IS NULL
		|");
	Query.SetParameter("Classifier", Classifier);
	NewRFTerritorialEntities = Query.Execute().Unload();
	
	// Rewrite only the missing ones.
	Set = InformationRegisters.AddressObjects.CreateRecordSet();
	Filter = Set.Filter.RFTerritorialEntityCode;
	
	For Each RFTerritorialEntity IN NewRFTerritorialEntities Do
		Filter.Set(RFTerritorialEntity.RFTerritorialEntityCode);
		Set.Clear();
		
		SourceData = Classifier.Find(RFTerritorialEntity.RFTerritorialEntityCode, "RFTerritorialEntityCode");
		
		NewRFTerritorialEntity = Set.Add();
		FillPropertyValues(NewRFTerritorialEntity, SourceData);
		NewRFTerritorialEntity.Level = 1;
		
		If InitialFillingAndDataUpdate Then
			InfobaseUpdate.WriteData(Set);
		Else
			Set.Write();
		EndIf;
	EndDo;
	
EndProcedure

// It returns information from the RF territorial entities classifier.
//
// Returns:
//     ValueTable - supplied data. Columns:
//       * RFTerritorialEntityCode  - Number  - territorial entity classifier code, for example, 77 for Moscow.
//       * Description   - String - Entity name by the classifier. For example, "Moscow".
//       * Abbreviation  - String - Entity name by the classifier. For example, "Region".
//       * PostalCode    - Number  - state index. If 0 - then it is undefined.
//       * Identifier    - UUID - FIAS identifier.
//
Function RFTerritorialEntitiesClassifier() Export
	
	Template = InformationRegisters.AddressObjects.GetTemplate("RFTerritorialEntitiesClassifier");
	
	Read = New XMLReader;
	Read.SetString(Template.GetText());
	Result = XDTOSerializer.ReadXML(Read);
	
	Return Result;
	
EndFunction

#EndRegion

#EndIf
